# ![Pizza](images/pizza.jpg)

# <span style="color: #FF4500;">Pizza Sales Analysis</span>

<span style="color:black;">Welcome to the comprehensive analysis of our pizza sales data! This report dives into the data to uncover valuable insights that will drive our business decisions and enhance our operations. We have categorized our analysis into Basic, Intermediate, and Advanced levels to answer various business questions effectively.</span>

In [1]:
%load_ext sql

%sql postgresql://postgres:pranshul@localhost:5432/pizzahut

In [2]:
import psycopg2
import pandas as pd 
import warnings
warnings.filterwarnings('ignore')

In [3]:
host = "localhost"
database = "pizzahut"
user = "postgres"
password = "pranshul"

In [4]:
# Connect to the PostgreSQL database
conn = psycopg2.connect(
    host=host,
    database=database,
    user=user,
    password=password
)

In [5]:
# create a curson object
cur = conn.cursor()

cur.execute("""
    SELECT table_name
    FROM information_schema.tables
    WHERE table_schema = 'public';
    """)

tables = cur.fetchall()

# convert the result to a list 
table_list = [table[0] for table in tables]

# print the list of tables
print('List of tables present in the database')
print(table_list)

List of tables present in the database
['order_details', 'order', 'pizza_types', 'pizza']

In [6]:
%%sql 
-- Explore the tables 
SELECT * FROM order_details
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/pizzahut
5 rows affected.

[(1, 1, 'hawaiian_m', 1),
 (2, 2, 'classic_dlx_m', 1),
 (3, 2, 'five_cheese_l', 1),
 (4, 2, 'ital_supr_l', 1),
 (5, 2, 'mexicana_m', 1)]

In [7]:
%%sql 
SELECT * FROM "order" -- double quotes because order is the keyword
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/pizzahut
5 rows affected.

[(1, datetime.date(2015, 1, 1), datetime.time(11, 38, 36)),
 (2, datetime.date(2015, 1, 1), datetime.time(11, 57, 40)),
 (3, datetime.date(2015, 1, 1), datetime.time(12, 12, 28)),
 (4, datetime.date(2015, 1, 1), datetime.time(12, 16, 31)),
 (5, datetime.date(2015, 1, 1), datetime.time(12, 21, 30))]

In [8]:
%%sql
SELECT * FROM pizza_types
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/pizzahut
5 rows affected.

[('bbq_ckn', 'The Barbecue Chicken Pizza', 'Chicken', 'Barbecued Chicken, Red Peppers, Green Peppers, Tomatoes, Red Onions, Barbecue Sauce'),
 ('cali_ckn', 'The California Chicken Pizza', 'Chicken', 'Chicken, Artichoke, Spinach, Garlic, Jalapeno Peppers, Fontina Cheese, Gouda Cheese'),
 ('ckn_alfredo', 'The Chicken Alfredo Pizza', 'Chicken', 'Chicken, Red Onions, Red Peppers, Mushrooms, Asiago Cheese, Alfredo Sauce'),
 ('ckn_pesto', 'The Chicken Pesto Pizza', 'Chicken', 'Chicken, Tomatoes, Red Peppers, Spinach, Garlic, Pesto Sauce'),
 ('southw_ckn', 'The Southwest Chicken Pizza', 'Chicken', 'Chicken, Tomatoes, Red Peppers, Red Onions, Jalapeno Peppers, Corn, Cilantro, Chipotle Sauce')]

In [9]:
%%sql
SELECT * FROM pizza
LIMIT 7;

 * postgresql://postgres:***@localhost:5432/pizzahut
7 rows affected.

[('bbq_ckn_s', 'bbq_ckn', 'S', Decimal('12.75')),
 ('bbq_ckn_m', 'bbq_ckn', 'M', Decimal('16.75')),
 ('bbq_ckn_l', 'bbq_ckn', 'L', Decimal('20.75')),
 ('cali_ckn_s', 'cali_ckn', 'S', Decimal('12.75')),
 ('cali_ckn_m', 'cali_ckn', 'M', Decimal('16.75')),
 ('cali_ckn_l', 'cali_ckn', 'L', Decimal('20.75')),
 ('ckn_alfredo_s', 'ckn_alfredo', 'S', Decimal('12.75'))]

lists all tables and their columns in a concatenated format that helps in quickly identifying the structure of the database, making it easier to find the necessary tables and columns for queries

In [10]:
%%sql
SELECT table_name, STRING_AGG(column_name,', ') AS columns
FROM information_schema.columns
WHERE table_schema = 'public'
GROUP BY table_name

 * postgresql://postgres:***@localhost:5432/pizzahut
4 rows affected.

[('order_details', 'order_id, pizza_id, order_details_id, quantity'),
 ('pizza', 'size, price, pizza_id, pizza_type_id'),
 ('pizza_types', 'name, category, ingredients, pizza_type_id'),
 ('order', 'order_time, order_id, order_date')]

###  Ques 1: Retrieve the total number of orders placed .

In [11]:
%%sql 
SELECT COUNT(distinct order_id) AS total_orders
FROM order_details

 * postgresql://postgres:***@localhost:5432/pizzahut
1 rows affected.

[(21350,)]

### Ques 2: Calcuate the total revenue generated from pizza sales

In [12]:
%%sql
SELECT SUM(price * quantity) AS total_revenue
FROM order_details AS o
JOIN pizza AS p
ON o.pizza_id = p.pizza_id;

 * postgresql://postgres:***@localhost:5432/pizzahut
1 rows affected.

[(Decimal('817860.05'),)]

### Ques 3: Identify the highest-priced pizza.

In [13]:
%%sql

SELECT 
    name, 
    price
FROM 
    pizza
JOIN 
    pizza_types
        USING(pizza_type_id)
WHERE 
    price = (SELECT MAX(price) FROM pizza)

 * postgresql://postgres:***@localhost:5432/pizzahut
1 rows affected.

[('The Greek Pizza', Decimal('35.95'))]

### Ques 4: Identify the most common pizza size ordered.

In [14]:
%%sql
SELECT 
    size,
    COUNT(*) AS size_count
FROM 
    order_details AS o 
JOIN pizza AS p
    USING(pizza_id)
GROUP BY
    size
ORDER BY
    size_count DESC;

 * postgresql://postgres:***@localhost:5432/pizzahut
5 rows affected.

[('L', 18526), ('M', 15385), ('S', 14137), ('XL', 544), ('XXL', 28)]

### Ques 5: List the top 5 most ordered pizza types along with their quantities.

In [15]:
%%sql 

SELECT 
    name,
    SUM(quantity) AS total_quantity
FROM 
    order_details AS o
JOIN 
    pizza AS p
        USING(pizza_id)
JOIN 
    pizza_types AS pt
        USING(pizza_type_id)
GROUP BY 
    name
ORDER BY
    total_quantity DESC
LIMIT 5;

 * postgresql://postgres:***@localhost:5432/pizzahut
5 rows affected.

[('The Classic Deluxe Pizza', 2453),
 ('The Barbecue Chicken Pizza', 2432),
 ('The Hawaiian Pizza', 2422),
 ('The Pepperoni Pizza', 2418),
 ('The Thai Chicken Pizza', 2371)]

### Ques 6: Join the necessary tables to find the total quantity of each pizza category ordered.

In [16]:
%%sql
SELECT 
    category,
    SUM(quantity) AS total_quantity
FROM 
    order_details AS o
JOIN pizza AS p 
    USING(pizza_id)
JOIN pizza_types AS pt 
    USING(pizza_type_id)
GROUP BY
category
ORDER BY
    total_quantity DESC

 * postgresql://postgres:***@localhost:5432/pizzahut
4 rows affected.

[('Classic', 14888), ('Supreme', 11987), ('Veggie', 11649), ('Chicken', 11050)]

### Ques 7: Determine the distribution of orders by hour of the day.

In [17]:
%%sql
SELECT 
    EXTRACT(hour FROM order_time) AS hour_24,
    COUNT(DISTINCT order_id) AS order_count
FROM 
    order_details AS od 
JOIN "order" AS o
    USING(order_id)
GROUP BY
    EXTRACT(hour FROM order_time)
ORDER BY
    order_count DESC;

 * postgresql://postgres:***@localhost:5432/pizzahut
15 rows affected.

[(Decimal('12'), 2520),
 (Decimal('13'), 2455),
 (Decimal('18'), 2399),
 (Decimal('17'), 2336),
 (Decimal('19'), 2009),
 (Decimal('16'), 1920),
 (Decimal('20'), 1642),
 (Decimal('14'), 1472),
 (Decimal('15'), 1468),
 (Decimal('11'), 1231),
 (Decimal('21'), 1198),
 (Decimal('22'), 663),
 (Decimal('23'), 28),
 (Decimal('10'), 8),
 (Decimal('9'), 1)]

### Ques 8: Find category wise distribution of pizzas.

In [18]:
%%sql 

SELECT
    category, 
    COUNT(name) 
FROM 
    pizza_types
GROUP BY 
    category

 * postgresql://postgres:***@localhost:5432/pizzahut
4 rows affected.

[('Supreme', 9), ('Chicken', 6), ('Classic', 8), ('Veggie', 9)]

### Ques 9: Group the orders by date and calculate the average number of pizzas ordered per day.

In [35]:
%%sql

SELECT ROUND(AVG(total_pizzas),2) AS avg_order_per_day
FROM
    (SELECT order_date, SUM(quantity) AS total_pizzas
    FROM "order" AS o
    JOIN order_details AS od
    ON o.order_id = od.order_id
    GROUP BY order_date) AS orders_per_day

 * postgresql://postgres:***@localhost:5432/pizzahut
1 rows affected.

[(Decimal('138.47'),)]

### Ques 9: Determine the top 3 most ordered pizza types based on revenue.

In [47]:
%%sql
SELECT 
    p.pizza_type_id,
    name,
    SUM(quantity * price) AS total_revenue
FROM order_details AS od
JOIN pizza AS p
    ON od.pizza_id = p.pizza_id
JOIN pizza_types AS pt
    ON p.pizza_type_id = pt.pizza_type_id
GROUP BY p.pizza_type_id, name
ORDER BY total_revenue DESC
LIMIT 3;

 * postgresql://postgres:***@localhost:5432/pizzahut
3 rows affected.

[('thai_ckn', 'The Thai Chicken Pizza', Decimal('43434.25')),
 ('bbq_ckn', 'The Barbecue Chicken Pizza', Decimal('42768.00')),
 ('cali_ckn', 'The California Chicken Pizza', Decimal('41409.50'))]

### Ques 10: Calculate the percentage contribution of each pizza Category to total revenue.

In [62]:
%%sql
SELECT 
    category,
    SUM(quantity * price) AS revenue,
    CAST(ROUND(SUM(quantity * price) / SUM(SUM(quantity * price)) OVER() * 100,3) AS VARCHAR) || '%' AS percentage_contribution
FROM pizza_types AS pt
JOIN pizza AS p
    ON pt.pizza_type_id = p.pizza_type_id
JOIN order_details AS od
    ON od.pizza_id = p.pizza_id
GROUP BY category
ORDER BY revenue DESC;

 * postgresql://postgres:***@localhost:5432/pizzahut
4 rows affected.

[('Classic', Decimal('220053.10'), '26.906%'),
 ('Supreme', Decimal('208197.00'), '25.456%'),
 ('Chicken', Decimal('195919.50'), '23.955%'),
 ('Veggie', Decimal('193690.45'), '23.683%')]

### Ques 10: Analyze the cummulative revenue generated over time.

In [71]:
%%sql

SELECT
    order_date,
    revenue,
    SUM(revenue) OVER(ORDER BY order_date) AS cum_revenue 
FROM 
    (SELECT order_date, SUM(price * quantity) AS revenue
    FROM order_details AS od
    JOIN pizza AS p
        ON od.pizza_id = p.pizza_id
    JOIN "order" AS o
        ON od.order_id = o.order_id
    GROUP BY order_date) AS sales
LIMIT 10

 * postgresql://postgres:***@localhost:5432/pizzahut
10 rows affected.

[(datetime.date(2015, 1, 1), Decimal('2713.85'), Decimal('2713.85')),
 (datetime.date(2015, 1, 2), Decimal('2731.90'), Decimal('5445.75')),
 (datetime.date(2015, 1, 3), Decimal('2662.40'), Decimal('8108.15')),
 (datetime.date(2015, 1, 4), Decimal('1755.45'), Decimal('9863.60')),
 (datetime.date(2015, 1, 5), Decimal('2065.95'), Decimal('11929.55')),
 (datetime.date(2015, 1, 6), Decimal('2428.95'), Decimal('14358.50')),
 (datetime.date(2015, 1, 7), Decimal('2202.20'), Decimal('16560.70')),
 (datetime.date(2015, 1, 8), Decimal('2838.35'), Decimal('19399.05')),
 (datetime.date(2015, 1, 9), Decimal('2127.35'), Decimal('21526.40')),
 (datetime.date(2015, 1, 10), Decimal('2463.95'), Decimal('23990.35'))]

### Ques 11: Determine the top 3 most ordered pizza types based on revenue for each pizza category.

In [84]:
%%sql
SELECT 
    category,
    name ,
    revenue
FROM 
    (SELECT 
     category,
     name, 
     revenue,
    RANK() OVER(PARTITION BY category ORDER BY revenue DESC) AS rn
FROM 
        (SELECT 
         pizza_types.category, 
         pizza_types.name,
        SUM(order_details.quantity * pizza.price) AS revenue
        FROM pizza_types 
        JOIN pizza
            ON pizza_types.pizza_type_id = pizza.pizza_type_id
        JOIN order_details
            ON order_details.pizza_id = pizza.pizza_id
        GROUP BY pizza_types.category, pizza_types.name) AS sub1) AS sub2
WHERE rn < 4;

 * postgresql://postgres:***@localhost:5432/pizzahut
12 rows affected.

[('Chicken', 'The Thai Chicken Pizza', Decimal('43434.25')),
 ('Chicken', 'The Barbecue Chicken Pizza', Decimal('42768.00')),
 ('Chicken', 'The California Chicken Pizza', Decimal('41409.50')),
 ('Classic', 'The Classic Deluxe Pizza', Decimal('38180.50')),
 ('Classic', 'The Hawaiian Pizza', Decimal('32273.25')),
 ('Classic', 'The Pepperoni Pizza', Decimal('30161.75')),
 ('Supreme', 'The Spicy Italian Pizza', Decimal('34831.25')),
 ('Supreme', 'The Italian Supreme Pizza', Decimal('33476.75')),
 ('Supreme', 'The Sicilian Pizza', Decimal('30940.50')),
 ('Veggie', 'The Four Cheese Pizza', Decimal('32265.70')),
 ('Veggie', 'The Mexicana Pizza', Decimal('26780.75')),
 ('Veggie', 'The Five Cheese Pizza', Decimal('26066.50'))]